# GetFilter Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..GetFilter Method
ScheduleDefinition Class See Also
---
Gets a filter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ScheduleFilter GetFilter(
	int index
)
```

Visual Basic
---
```text
Public Function GetFilter ( _
	index As Integer _
) As ScheduleFilter
```

Visual C++
---
```text
public:
ScheduleFilter^ GetFilter(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 The index of the filter.
# ### Return Value
A copy of the filter.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | index is not a valid filter index. |

# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace